In [1]:
import scipy.stats
import numpy as np
import pandas as pd

In [2]:
dft = pd.read_csv('total_foreigntourist_arrivals_byflight.csv')
dfsb = pd.read_csv('sun_beach_foreigntourist.csv')

In [9]:
dft.tail()

           Mes  año2017  año2018  año2019  año2020  año2021
7       Agosto   161281   179439   182376       15  94048.0
8   Septiembre   135692   142507   140451     2898  92579.0
9      Octubre   131919   138349   140843    22302      NaN
10   Noviembre   149968   168282   159824    38266      NaN
11   Diciembre   198404   217358   205927    74816      NaN

In [12]:
a = dft.fillna(0) # new total tourism df with no NaN values

In [13]:
a.head()

       Mes  año2017  año2018  año2019  año2020  año2021
0    Enero   134151   165197   160963   172554  43431.0
1  Febrero   150633   179985   182275   203114  39264.0
2   Marzo    143093   191521   183636    84808  56833.0
3   Abril    142095   154117   156779        2  42981.0
4     Mayo   124155   147973   146307        1  39317.0

In [15]:
dfsb.head()

       Mes  año2017  año2018  año2019  año2020  año2021
0    Enero    43375    55860    56274  58842.0  10329.0
1  Febrero    54363    65552    70479  76463.0  10531.0
2   Marzo     48589    67537    70863  31821.0  13742.0
3   Abril     43463    50966    52267      NaN  12087.0
4     Mayo    36656    46215    48208      NaN  10885.0

In [16]:
b = dfsb.fillna(0) # new sun and beach df with no NaN values

In [17]:
b.head()

       Mes  año2017  año2018  año2019  año2020  año2021
0    Enero    43375    55860    56274  58842.0  10329.0
1  Febrero    54363    65552    70479  76463.0  10531.0
2   Marzo     48589    67537    70863  31821.0  13742.0
3   Abril     43463    50966    52267      0.0  12087.0
4     Mayo    36656    46215    48208      0.0  10885.0

# Looking for correlations between total tourist (a) vs. sun&beach tourist(b)

STARTING WITH THE PANDEMIC YEARS (2020 and 2021)

In [18]:
x = a['año2020']
y = b['año2020']

In [19]:
scipy.stats.pearsonr(x, y) # Pearson correlation

(0.9855254485473857, 4.8839378248282894e-09)

In [20]:
x = a['año2021']
y = b['año2021']

In [21]:
scipy.stats.pearsonr(x, y) # Pearson correlation

(0.9969957908809732, 1.9174568456585486e-12)

The correlation coefficient (Pearson) is very strong for these years, 0.98 and 0.99 respectively.

CORRELATION FOR THE YEARS 2018 AND 2019 (PRE-PANDEMIC YEARS)

In [22]:
x = a['año2018']
y = b['año2018']

In [23]:
scipy.stats.pearsonr(x, y) # Pearson correlation

(0.6529664796439565, 0.021328547191371047)

In [24]:
x = a['año2019']
y = b['año2019']

In [25]:
scipy.stats.pearsonr(x, y) # Pearson correlation

(0.6360429926395192, 0.026195953129668784)

The correlation coefficients (Pearson) are not stronger as the presented in the pandemic years (2020 and 2021).